{"101,32": 256, "116,104": 257, "116,32": 258, "115,32": 259, "100,32": 260, "44,32": 261, "111,117": 262, "101,114": 263, "105,110": 264, "121,32": 265, "97,110": 266, "58,10": 267, "111,114": 268, "111,32": 269, "101,110": 270, "10,10": 271, "97,114": 272, "32,257": 273, "111,110": 274, "108,108": 275, "104,97": 276, "44,10": 277, "46,271": 278, "105,259": 279, "101,115": 280, "121,262": 281, "32,115": 282, "116,269": 283, "266,260": 284, "111,119": 285, "101,97": 286, "32,109": 287, "32,119": 288, "111,102": 289, "32,104": 290, "264,103": 291, "111,109": 292, "32,97": 293, "99,104": 294, "257,256": 295, "115,116": 296, "32,98": 297, "110,111": 298, "105,114": 299, "102,268": 300, "118,256": 301, "101,261": 302, "105,257": 303, "273,256": 304, "115,101": 305, "108,105": 306, "84,104": 307, "275,32": 308, "114,101": 309, "115,258": 310, "97,258": 311, "65,110": 312, "73,32": 313, "101,272": 314, "105,109": 315, "105,116": 316, "111,111": 317, "103,104": 318, "97,116": 319, "105,115": 320, "108,101": 321, "263,32": 322, "262,114": 323, "312,260": 324, "39,259": 325, "101,101": 326, "298,258": 327, "109,265": 328, "59,10": 329, "114,97": 330, "46,10": 331, "281,114": 332, "117,114": 333, "276,258": 334, "114,105": 335, "117,258": 336, "108,260": 337, "289,32": 338, "79,267": 339, "101,260": 340, "108,97": 341, "105,258": 342, "114,111": 343, "263,256": 344, "101,259": 345, "100,261": 346, "117,110": 347, "69,78": 348, "107,256": 349, "121,261": 350, "73,78": 351, "32,100": 352, "63,271": 353, "97,259": 354, "102,97": 355, "119,303": 356, "276,301": 357, "83,267": 358, "32,99": 359, "87,104": 360, "257,311": 361, "270,116": 362, "257,101": 363, "99,101": 364, "115,104": 365, "109,97": 366, "32,112": 367, "257,263": 368, "98,101": 369, "46,32": 370, "65,82": 371, "99,256": 372, "291,32": 373, "97,108": 374, "59,32": 375, "257,262": 376, "115,261": 377, "109,256": 378, "115,256": 379, "108,111": 380, "99,107": 381, "119,104": 382, "105,108": 383, "39,260": 384, "73,339": 385, "110,285": 386, "105,275": 387, "98,256": 388, "101,275": 389, "114,286": 390, "32,116": 391, "116,261": 392, "262,337": 393, "101,10": 394, "287,265": 395, "118,263": 396, "99,292": 397, "104,256": 398, "32,283": 399, "32,73": 400, "101,108": 401, "85,358": 402, "111,108": 403, "100,105": 404, "32,103": 405, "97,265": 406, "116,263": 407, "97,264": 408, "32,281": 409, "307,256": 410, "108,256": 411, "105,274": 412, "32,102": 413, "114,117": 414, "105,102": 415, "101,109": 416, "266,100": 417, "84,269": 418, "105,318": 419, "272,256": 420, "117,112": 421, "277,324": 422, "104,315": 423, "101,100": 424, "105,308": 425, "268,100": 426, "105,294": 427, "108,265": 428, "317,260": 429, "85,67": 430, "285,110": 431, "104,279": 432, "351,71": 433, "32,284": 434, "99,274": 435, "110,101": 436, "97,121": 437, "101,278": 438, "114,292": 439, "105,100": 440, "117,115": 441, "262,110": 442, "65,78": 443, "109,266": 444, "97,103": 445, "69,82": 446, "79,82": 447, "101,258": 448, "114,280": 449, "305,108": 450, "290,279": 451, "101,277": 452, "101,116": 453, "99,97": 454, "32,264": 455, "115,276": 456, "33,10": 457, "69,84": 458, "84,334": 459, "112,111": 460, "113,117": 461, "257,265": 462, "33,271": 463, "109,268": 464, "117,108": 465, "110,269": 466, "97,109": 467, "273,101": 468, "65,267": 469, "118,270": 470, "98,265": 471, "115,10": 472, "115,112": 473, "75,433": 474, "290,315": 475, "257,279": 476, "273,279": 477, "104,263": 478, "273,311": 479, "111,257": 480, "63,10": 481, "274,103": 482, "66,336": 483, "280,258": 484, "111,261": 485, "98,336": 486, "32,289": 487, "70,268": 488, "115,117": 489, "288,303": 490, "117,116": 491, "274,256": 492, "97,275": 493, "73,67": 494, "270,100": 495, "79,76": 496, "100,269": 497, "73,288": 498, "292,256": 499, "107,386": 500, "115,277": 501, "115,299": 502, "261,284": 503, "99,116": 504, "117,259": 505, "280,259": 506, "450,102": 507, "282,116": 508, "97,349": 509, "69,76": 510, "107,291": 511, "108,286": 512, "288,104": 513, "272,100": 514, "111,112": 515, "119,268": 516, "297,256": 517, "97,100": 518, "73,402": 519, "474,32": 520, "371,68": 521, "273,262": 522, "115,269": 523, "32,332": 524, "104,314": 525, "270,258": 526, "109,111": 527, "280,116": 528, "116,111": 529, "45,45": 530, "99,105": 531, "83,84": 532, "77,265": 533, "281,32": 534, "270,32": 535, "39,116": 536, "262,259": 537, "119,256": 538, "100,10": 539, "108,317": 540, "58,32": 541, "69,267": 542, "100,101": 543, "33,32": 544, "73,39": 545, "293,109": 546, "273,265": 547, "79,78": 548, "290,256": 549, "264,32": 550, "114,266": 551, "264,107": 552, "115,97": 553, "100,286": 554, "266,32": 555, "263,101": 556, "117,294": 557, "282,276": 558, "320,104": 559, "115,274": 560, "105,301": 561, "102,439": 562, "103,429": 563, "117,310": 564, "115,119": 565, "278,67": 566, "97,98": 567, "108,426": 568, "65,259": 569, "276,257": 570, "87,334": 571, "278,80": 572, "97,32": 573, "286,107": 574, "114,285": 575, "116,10": 576, "264,256": 577, "262,108": 578, "105,103": 579, "100,263": 580, "89,262": 581, "112,263": 582, "380,118": 583, "278,76": 584, "112,114": 585, "306,349": 586, "521,400": 587, "72,97": 588, "329,324": 589, "82,79": 590, "256,283": 591, "280,115": 592, "84,385": 593, "109,101": 594, "105,99": 595, "262,318": 596, "282,104": 597, "421,274": 598, "73,267": 599, "262,258": 600, "268,32": 601, "121,10": 602, "458,267": 603, "119,354": 604, "65,85": 605, "112,343": 606, "99,266": 607, "119,334": 608, "263,118": 609, "321,258": 610, "97,350": 611, "89,32": 612, "266,116": 613, "105,260": 614, "313,357": 615, "69,32": 616, "323,32": 617, "297,336": 618, "300,32": 619, "297,101": 620, "104,286": 621, "306,102": 622, "97,115": 623, "119,389": 624, "101,121": 625, "111,337": 626, "277,360": 627, "73,110": 628, "299,310": 629, "117,109": 630, "63,32": 631, "266,103": 632, "73,546": 633, "32,338": 634, "105,296": 635, "363,109": 636, "270,260": 637, "75,267": 638, "276,116": 639, "73,102": 640, "332,32": 641, "494,72": 642, "119,272": 643, "82,642": 644, "326,112": 645, "376,32": 646, "68,85": 647, "647,75": 648, "102,465": 649, "648,616": 650, "115,111": 651, "111,100": 652, "293,259": 653, "116,116": 654, "300,256": 655, "116,414": 656, "105,381": 657, "276,260": 658, "87,303": 659, "98,411": 660, "419,116": 661, "112,112": 662, "348,593": 663, "116,315": 664, "446,267": 665, "264,100": 666, "464,256": 667, "73,282": 668, "363,265": 669, "280,261": 670, "278,66": 671, "456,275": 672, "280,256": 673, "278,520": 674, "278,83": 675, "119,425": 676, "355,368": 677, "101,120": 678, "278,71": 679, "100,111": 680, "375,284": 681, "89,267": 682, "257,270": 683, "290,263": 684, "119,344": 685, "293,275": 686, "79,261": 687, "351,67": 688, "285,32": 689, "287,256": 690, "101,325": 691, "98,108": 692, "72,256": 693, "108,268": 694, "278,77": 695, "111,379": 696, "579,110": 697, "98,343": 698, "283,295": 699, "114,265": 700, "117,318": 701, "79,102": 702, "287,101": 703, "101,112": 704, "396,265": 705, "292,101": 706, "264,304": 707, "270,364": 708, "10,418": 709, "65,66": 710, "119,387": 711, "102,335": 712, "554,257": 713, "270,372": 714, "100,277": 715, "293,32": 716, "419,258": 717, "112,272": 718, "266,265": 719, "540,107": 720, "97,119": 721, "366,349": 722, "545,308": 723, "76,79": 724, "644,587": 725, "70,629": 726, "69,532": 727, "257,322": 728, "436,119": 729, "363,299": 730, "288,334": 731, "430,72": 732, "105,118": 733, "119,393": 734, "99,302": 735, "259,284": 736, "103,330": 737, "103,101": 738, "272,109": 739, "724,430": 740, "740,727": 741, "741,665": 742, "121,448": 743, "355,299": 744, "118,111": 745, "114,431": 746, "69,348": 747, "363,256": 748, "468,299": 749, "307,279": 750, "382,427": 751, "282,269": 752, "307,262": 753, "76,73": 754, "333,256": 755, "288,256": 756, "366,100": 757, "121,507": 758, "365,256": 759, "101,102": 760, "296,263": 761, "274,323": 762, "101,118": 763, "261,328": 764, "306,118": 765, "101,308": 766, "380,301": 767, "326,258": 768, "101,504": 769, "264,260": 770, "273,416": 771, "289,304": 772, "257,266": 773, "404,260": 774, "81,85": 775, "775,747": 776, "86,688": 777, "777,663": 778, "456,308": 779, "67,292": 780, "79,70": 781, "781,32": 782, "289,102": 783, "298,116": 784, "333,110": 785, "77,272": 786, "282,112": 787, "326,100": 788, "257,291": 789, "356,32": 790, "32,300": 791, "65,77": 792, "118,105": 793, "101,270": 794, "72,348": 795, "112,341": 796, "111,39": 797, "97,107": 798, "445,408": 799, "502,261": 800, "117,379": 801, "318,116": 802, "103,561": 803, "10,324": 804, "121,277": 805, "103,111": 806, "71,111": 807, "97,308": 808, "397,256": 809, "83,269": 810, "795,82": 811, "811,612": 812, "101,99": 813, "109,272": 814, "536,279": 815, "69,83": 816, "305,260": 817, "318,258": 818, "103,256": 819, "267,65": 820, "268,256": 821, "290,314": 822, "116,509": 823, "362,321": 824, "100,320": 825, "447,73": 826, "110,103": 827, "262,115": 828, "111,368": 829, "98,263": 830, "104,322": 831, "100,117": 832, "650,778": 833, "32,279": 834, "776,32": 835, "106,111": 836, "69,358": 837, "73,259": 838, "285,263": 839, "101,39": 840, "274,101": 841, "109,270": 842, "89,447": 843, "843,638": 844, "99,442": 845, "97,112": 846, "272,258": 847, "117,296": 848, "319,256": 849, "100,280": 850, "87,256": 851, "319,412": 852, "79,114": 853, "473,574": 854, "32,342": 855, "102,105": 856, "351,519": 857, "32,327": 858, "112,330": 859, "39,100": 860, "116,119": 861, "267,78": 862, "359,292": 863, "105,122": 864, "273,266": 865, "366,265": 866, "268,110": 867, "281,261": 868, "280,10": 869, "97,99": 870, "39,84": 871, "73,258": 872, "109,557": 873, "69,68": 874, "874,87": 875, "108,417": 876, "97,701": 877, "44,530": 878, "111,310": 879, "390,258": 880, "365,393": 881, "360,427": 882, "84,72": 883, "317,107": 884, "103,408": 885, "382,270": 886, "85,77": 887, "360,350": 888, "98,111": 889, "65,76": 890, "116,322": 891, "73,287": 892, "527,310": 893, "108,482": 894, "102,314": 895, "290,286": 896, "442,100": 897, "32,313": 898, "73,83": 899, "116,259": 900, "115,499": 901, "510,76": 902, "329,488": 903, "435,260": 904, "116,340": 905, "266,258": 906, "69,100": 907, "257,552": 908, "298,660": 909, "268,260": 910, "97,381": 911, "39,310": 912, "79,77": 913, "108,506": 914, "277,418": 915, "77,69": 916, "276,392": 917, "103,269": 918, "277,459": 919, "272,101": 920, "104,285": 921, "65,80": 922, "590,916": 923, "923,339": 924, "348,348": 925, "925,519": 926, "303,263": 927, "287,266": 928, "302,284": 929, "104,344": 930, "66,265": 931, "109,564": 932, "112,449": 933, "97,102": 934, "309,109": 935, "458,82": 936, "936,732": 937, "937,385": 938, "309,112": 939, "259,283": 940, "297,265": 941, "116,389": 942, "105,112": 943, "111,258": 944, "72,285": 945, "108,121": 946, "109,362": 947, "259,289": 948, "272,260": 949, "807,260": 950, "101,904": 951, "103,117": 952, "10,65": 953, "100,265": 954, "694,346": 955, "309,116": 956, "780,302": 957, "10,410": 958, "264,372": 959, "274,32": 960, "82,706": 961, "268,116": 962, "548,84": 963, "111,275": 964, "266,346": 965, "101,331": 966, "267,307": 967, "413,439": 968, "267,83": 969, "712,495": 970, "826,496": 971, "971,443": 972, "293,258": 973, "607,327": 974, "558,308": 975, "403,100": 976, "972,402": 977, "101,353": 978, "114,482": 979, "115,99": 980, "344,279": 981, "100,437": 982, "674,725": 983, "66,101": 984, "257,319": 985, "114,121": 986, "112,101": 987, "286,108": 988, "115,115": 989, "110,97": 990, "461,794": 991, "82,427": 992, "119,657": 993, "278,726": 994, "110,506": 995, "114,270": 996, "319,294": 997, "333,305": 998, "316,864": 999, "999,270": 1000, "529,269": 1001, "115,406": 1002, "32,276": 1003, "442,260": 1004, "351,469": 1005, "259,338": 1006, "114,596": 1007, "282,398": 1008, "290,322": 1009, "288,425": 1010, "98,314": 1011, "277,83": 1012, "359,274": 1013, "105,111": 1014, "257,326": 1015, "97,296": 1016, "73,599": 1017, "306,101": 1018, "320,256": 1019, "109,274": 1020, "468,265": 1021, "305,256": 1022, "267,410": 1023, "405,330": 1024, "98,321": 1025, "267,324": 1026, "326,260": 1027, "435,116": 1028, "283,388": 1029, "409,32": 1030, "545,275": 1031, "282,557": 1032, "383,100": 1033, "581,32": 1034, "89,323": 1035, "87,272": 1036, "112,512": 1037, "116,265": 1038, "313,497": 1039, "342,279": 1040, "679,742": 1041, "1036,993": 1042, "85,110": 1043, "112,309": 1044, "79,110": 1045, "377,284": 1046, "111,396": 1047, "100,480": 1048, "117,309": 1049, "391,111": 1050, "482,117": 1051, "114,256": 1052, "72,279": 1053, "65,68": 1054, "782,844": 1055, "292,266": 1056, "498,425": 1057, "98,390": 1058, "116,408": 1059, "871,279": 1060, "117,381": 1061, "78,285": 1062, "899,710": 1063, "1063,902": 1064, "1064,469": 1065, "102,108": 1066, "10,459": 1067, "468,256": 1068, "278,833": 1069, "82,443": 1070, "316,265": 1071, "32,274": 1072, "313,500": 1073, "288,387": 1074, "272,107": 1075, "76,448": 1076, "298,392": 1077, "312,346": 1078, "101,119": 1079, "454,275": 1080, "597,393": 1081, "291,261": 1082, "76,910": 1083, "74,85": 1084, "1084,754": 1085, "1085,603": 1086, "69,963": 1087, "1087,837": 1088, "97,367": 1089, "83,299": 1090, "280,277": 1091, "110,268": 1092, "368,101": 1093, "110,661": 1094, "824,444": 1095, "320,274": 1096, "424,10": 1097, "276,118": 1098, "115,267": 1099, "307,266": 1100, "263,267": 1101, "119,415": 1102, "97,257": 1103, "97,297": 1104, "333,580": 1105, "1054,612": 1106, "99,108": 1107, "117,392": 1108, "273,673": 1109, "86,496": 1110, "558,275": 1111, "643,260": 1112, "698,368": 1113, "348,67": 1114, "1114,542": 1115, "101,396": 1116, "489,294": 1117, "321,116": 1118, "116,347": 1119, "295,115": 1120, "359,266": 1121, "524,32": 1122, "100,431": 1123, "757,256": 1124, "101,346": 1125, "383,256": 1126, "117,100": 1127, "306,654": 1128, "115,278": 1129, "268,107": 1130, "266,372": 1131, "116,330": 1132, "273,552": 1133, "494,857": 1134, "115,331": 1135, "436,396": 1136, "107,645": 1137, "498,393": 1138, "87,917": 1139, "319,407": 1140, "99,323": 1141, "87,389": 1142, "639,325": 1143, "114,291": 1144, "270,261": 1145, "78,268": 1146, "39,258": 1147, "119,426": 1148, "104,417": 1149, "294,272": 1150, "109,263": 1151, "512,301": 1152, "77,371": 1153, "623,115": 1154, "335,760": 1155, "108,272": 1156, "341,119": 1157, "69,682": 1158, "480,322": 1159, "316,261": 1160, "326,108": 1161, "97,287": 1162, "416,112": 1163, "531,537": 1164, "119,437": 1165, "102,299": 1166, "105,372": 1167, "66,256": 1168, "328,568": 1169, "430,385": 1170, "314,257": 1171, "32,323": 1172, "98,330": 1173, "84,73": 1174, "257,344": 1175, "875,587": 1176, "1176,86": 1177, "67,1000": 1178, "374,107": 1179, "317,100": 1180, "102,102": 1181, "514,274": 1182, "110,467": 1183, "300,304": 1184, "109,264": 1185, "100,877": 1186, "273,326": 1187, "82,73": 1188, "401,112": 1189, "588,301": 1190, "282,117": 1191, "116,270": 1192, "109,302": 1193, "39,32": 1194, "104,262": 1195, "261,361": 1196, "369,270": 1197, "263,259": 1198, "102,117": 1199, "114,350": 1200, "121,374": 1201, "89,1130": 1202, "397,345": 1203, "307,101": 1204, "105,321": 1205, "352,269": 1206, "257,673": 1207, "326,294": 1208, "72,270": 1209, "287,302": 1210, "101,267": 1211, "572,938": 1212, "399,295": 1213, "281,287": 1214, "83,116": 1215, "97,383": 1216, "99,746": 1217, "262,116": 1218, "293,308": 1219, "288,354": 1220, "835,510": 1221, "1221,73": 1222, "1222,90": 1223, "1223,710": 1224, "1224,458": 1225, "1225,72": 1226, "110,319": 1227, "116,1051": 1228, "119,514": 1229, "101,329": 1230, "268,575": 1231, "264,116": 1232, "376,318": 1233, "101,256": 1234, "353,66": 1235, "309,256": 1236, "441,98": 1237, "59,618": 1238, "97,288": 1239, "119,406": 1240, "695,926": 1241, "99,272": 1242, "389,285": 1243, "471,295": 1244, "112,97": 1245, "353,80": 1246, "341,381": 1247, "115,437": 1248, "103,880": 1249, "405,429": 1250, "279,295": 1251, "83,32": 1252, "283,328": 1253, "83,609": 1254, "621,470": 1255, "1128,411": 1256, "116,105": 1257, "118,322": 1258, "294,1033": 1259, "115,578": 1260, "102,317": 1261, "369,103": 1262, "525,116": 1263, "115,329": 1264, "99,276": 1265, "627,427": 1266, "10,569": 1267, "316,121": 1268, "100,406": 1269, "341,100": 1270, "445,256": 1271, "71,429": 1272, "266,559": 1273, "68,267": 1274, "87,371": 1275, "1275,87": 1276, "1276,494": 1277, "1277,638": 1278, "266,364": 1279, "263,261": 1280, "105,364": 1281, "82,85": 1282, "1282,84": 1283, "290,762": 1284, "104,762": 1285, "65,532": 1286, "812,86": 1287, "105,101": 1288, "316,268": 1289, "417,10": 1290, "319,116": 1291, "39,539": 1292, "98,286": 1293, "261,382": 1294, "100,314": 1295, "264,477": 1296, "282,499": 1297, "504,412": 1298, "83,276": 1299, "672,517": 1300, "109,758": 1301, "65,350": 1302, "352,286": 1303, "566,977": 1304, "264,395": 1305, "274,304": 1306, "71,742": 1307, "72,792": 1308, "435,115": 1309, "102,964": 1310, "259,420": 1311, "300,257": 1312, "401,265": 1313, "79,32": 1314, "97,282": 1315, "565,768": 1316, "261,502": 1317, "307,265": 1318, "330,119": 1319, "922,85": 1320, "1320,76": 1321, "1321,603": 1322, "73,443": 1323, "813,258": 1324, "109,577": 1325, "99,333": 1326, "347,580": 1327, "78,944": 1328, "259,295": 1329, "114,347": 1330, "116,335": 1331, "556,325": 1332, "365,943": 1333, "98,540": 1334, "390,560": 1335, "362,411": 1336, "288,393": 1337, "320,261": 1338, "567,411": 1339, "454,801": 1340, "277,65": 1341, "119,314": 1342, "121,314": 1343, "103,114": 1344, "664,256": 1345, "281,827": 1346, "679,82": 1347, "73,76": 1348, "987,515": 1349, "787,574": 1350, "261,295": 1351, "360,269": 1352, "920,624": 1353, "112,335": 1354, "346,284": 1355, "990,378": 1356, "375,300": 1357, "356,304": 1358, "527,368": 1359, "321,704": 1360, "278,72": 1361, "78,998": 1362, "112,333": 1363, "316,256": 1364, "101,705": 1365, "297,343": 1366, "1283,402": 1367, "293,885": 1368, "430,474": 1369, "1369,1308": 1370, "446,76": 1371, "278,924": 1372, "367,114": 1373, "118,345": 1374, "70,439": 1375, "287,97": 1376, "78,611": 1377, "455,32": 1378, "383,258": 1379, "117,305": 1380, "498,387": 1381, "298,789": 1382, "276,662": 1383, "812,66": 1384, "1384,496": 1385, "1385,433": 1386, "1386,66": 1387, "1387,590": 1388, "1388,75": 1389, "1389,542": 1390, "76,605": 1391, "84,1070": 1392, "1392,385": 1393, "513,427": 1394, "440,256": 1395, "287,509": 1396, "10,702": 1397, "104,101": 1398, "287,577": 1399, "309,260": 1400, "310,376": 1401, "520,725": 1402, "584,1088": 1403, "289,451": 1404, "112,108": 1405, "79,333": 1406, "390,100": 1407, "277,410": 1408, "518,256": 1409, "118,101": 1410, "343,1201": 1411, "983,1017": 1412, "266,565": 1413, "319,268": 1414, "585,264": 1415, "101,697": 1416, "464,575": 1417, "117,377": 1418, "366,761": 1419, "273,270": 1420, "366,107": 1421, "320,10": 1422, "353,67": 1423, "355,108": 1424, "835,1153": 1425, "1425,71": 1426, "1426,371": 1427, "1427,603": 1428, "816,1252": 1429, "296,261": 1430, "107,387": 1431, "797,304": 1432, "287,821": 1433, "274,100": 1434, "390,116": 1435, "78,485": 1436, "119,766": 1437, "306,107": 1438, "112,104": 1439, "274,302": 1440, "516,108": 1441, "259,361": 1442, "257,373": 1443, "112,286": 1444, "75,373": 1445, "792,1348": 1446, "1446,76": 1447, "65,883": 1448, "460,268": 1449, "675,951": 1450, "101,470": 1451, "118,299": 1452, "267,72": 1453, "97,391": 1454, "261,415": 1455, "297,108": 1456, "294,632": 1457, "119,97": 1458, "289,395": 1459, "397,112": 1460, "287,406": 1461, "67,1156": 1462, "316,412": 1463, "313,859": 1464, "89,448": 1465, "262,294": 1466, "106,848": 1467, "270,103": 1468, "58,400": 1469, "594,266": 1470, "32,466": 1471, "71,82": 1472, "443,71": 1473, "1473,510": 1474, "1474,339": 1475, "99,393": 1476, "116,117": 1477, "116,317": 1478, "107,110": 1479, "534,357": 1480, "1142,261": 1481, "273,319": 1482, "293,282": 1483, "319,105": 1484, "103,272": 1485, "98,480": 1486, "444,265": 1487, "69,827": 1488, "371,1005": 1489, "786,531": 1490, "116,121": 1491, "115,609": 1492, "99,111": 1493, "99,99": 1494, "97,662": 1495, "763,322": 1496, "109,320": 1497, "270,735": 1498, "436,1258": 1499, "288,344": 1500, "896,470": 1501, "435,102": 1502, "97,352": 1503, "97,413": 1504, "117,349": 1505, "75,1448": 1506, "1506,1489": 1507, "115,370": 1508, "100,262": 1509, "83,104": 1510, "293,367": 1511, "297,480": 1512, "397,302": 1513, "107,373": 1514, "261,354": 1515, "98,652": 1516, "10,87": 1517, "105,305": 1518, "1186,407": 1519, "105,266": 1520, "529,45": 1521, "282,111": 1522, "104,403": 1523, "73,548": 1524, "799,310": 1525, "288,389": 1526, "85,112": 1527, "115,341": 1528, "58,618": 1529, "277,569": 1530, "100,270": 1531, "105,345": 1532, "340,283": 1533, "68,269": 1534, "360,265": 1535, "556,655": 1536, "816,67": 1537, "1537,890": 1538, "1538,402": 1539, "290,417": 1540, "360,270": 1541, "101,45": 1542, "115,302": 1543, "257,505": 1544, "78,269": 1545, "360,344": 1546, "288,268": 1547, "112,336": 1548, "299,260": 1549, "32,598": 1550, "369,655": 1551, "267,533": 1552, "635,449": 1553, "423,507": 1554, "108,350": 1555, "108,258": 1556, "305,258": 1557, "386,261": 1558, "300,1119": 1559, "272,116": 1560, "588,257": 1561, "390,109": 1562, "290,344": 1563, "343,745": 1564, "80,446": 1565, "297,390": 1566, "1204,265": 1567, "300,109": 1568, "257,261": 1569, "103,309": 1570, "102,272": 1571, "99,362": 1572, "556,300": 1573, "71,269": 1574, "622,256": 1575, "274,116": 1576, "277,483": 1577, "355,728": 1578, "68,1505": 1579, "68,732": 1580, "268,258": 1581, "97,306": 1582, "102,1243": 1583, "295,103": 1584, "290,285": 1585, "321,260": 1586, "289,287": 1587, "112,1182": 1588, "76,371": 1589, "104,111": 1590, "72,689": 1591, "71,652": 1592, "363,302": 1593, "118,387": 1594, "584,1106": 1595, "1579,338": 1596, "590,83": 1597, "278,1065": 1598, "355,465": 1599, "299,256": 1600, "352,320": 1601, "296,284": 1602, "610,378": 1603, "525,258": 1604, "703,266": 1605, "675,1134": 1606, "101,370": 1607, "10,77": 1608, "104,323": 1609, "105,120": 1610, "329,483": 1611, "108,302": 1612, "99,280": 1613, "277,488": 1614, "828,264": 1615, "287,564": 1616, "115,284": 1617, "263,99": 1618, "341,265": 1619, "280,1208": 1620, "73,469": 1621, "97,359": 1622, "116,314": 1623, "97,299": 1624, "98,374": 1625, "115,422": 1626, "554,100": 1627, "306,802": 1628, "108,262": 1629, "104,261": 1630, "1447,339": 1631, "104,1189": 1632, "382,269": 1633, "382,344": 1634, "353,77": 1635, "409,261": 1636, "69,470": 1637, "104,268": 1638, "115,516": 1639, "397,109": 1640, "305,416": 1641, "490,32": 1642, "290,515": 1643, "99,341": 1644, "106,528": 1645, "1580,1429": 1646, "1646,1055": 1647, "1287,599": 1648, "115,58": 1649, "487,102": 1650, "115,286": 1651, "286,294": 1652, "277,853": 1653, "291,259": 1654, "455,304": 1655, "67,499": 1656, "277,87": 1657, "401,379": 1658, "115,292": 1659, "737,1164": 1660, "278,70": 1661, "1226,267": 1662, "447,84": 1663, "1663,348": 1664, "1664,83": 1665, "294,105": 1666, "98,106": 1667, "347,100": 1668, "270,416": 1669, "66,1108": 1670, "296,414": 1671, "298,576": 1672, "98,97": 1673, "288,272": 1674, "423,32": 1675, "401,100": 1676, "369,291": 1677, "367,263": 1678, "264,451": 1679, "907,1112": 1680, "1188,371": 1681, "1681,32": 1682, "1665,385": 1683, "309,470": 1684, "1452,1477": 1685, "441,264": 1686, "530,10": 1687, "403,404": 1688, "306,301": 1689, "364,733": 1690, "306,112": 1691, "551,258": 1692, "578,100": 1693, "296,417": 1694, "276,296": 1695, "704,478": 1696, "338,332": 1697, "107,666": 1698, "625,345": 1699, "84,121": 1700, "326,109": 1701, "99,380": 1702, "907,1229": 1703, "522,32": 1704, "1564,296": 1705, "922,1174": 1706, "1706,532": 1707, "1707,469": 1708, "1178,267": 1709, "303,322": 1710, "105,537": 1711, "73,297": 1712, "656,256": 1713, "913,857": 1714, "353,83": 1715, "39,346": 1716, "282,406": 1717, "102,258": 1718, "621,100": 1719, "875,521": 1720, "605,84": 1721, "1721,496": 1722, "1722,89": 1723, "1723,67": 1724, "1724,402": 1725, "584,1170": 1726, "97,405": 1727, "306,365": 1728, "347,116": 1729, "297,540": 1730, "101,58": 1731, "105,39": 1732, "391,315": 1733, "314,110": 1734, "1509,98": 1735, "1062,261": 1736, "117,365": 1737, "391,119": 1738, "861,269": 1739, "109,526": 1740, "98,1273": 1741, "649,32": 1742, "77,1105": 1743, "1589,1115": 1744, "67,85": 1745, "718,116": 1746, "319,302": 1747, "98,911": 1748, "378,283": 1749, "103,448": 1750, "1310,285": 1751, "261,486": 1752, "73,1133": 1753, "103,97": 1754, "307,1549": 1755, "350,284": 1756, "101,422": 1757, "335,818": 1758, "832,107": 1759, "1370,267": 1760, "1362,267": 1761, "108,431": 1762, "348,837": 1763, "398,279": 1764, "118,280": 1765, "100,292": 1766, "39,308": 1767, "326,116": 1768, "295,119": 1769, "352,111": 1770, "397,591": 1771, "274,261": 1772, "98,614": 1773, "677,325": 1774, "101,375": 1775, "99,309": 1776, "98,333": 1777, "1177,267": 1778, "78,447": 1779, "348,1110": 1780, "1780,385": 1781, "347,283": 1782, "270,596": 1783, "116,97": 1784, "935,416": 1785, "273,320": 1786, "277,307": 1787, "355,364": 1788, "365,285": 1789, "121,331": 1790, "270,115": 1791, "264,293": 1792, "562,32": 1793, "261,283": 1794, "118,265": 1795, "353,76": 1796, "107,264": 1797, "69,77": 1798, "887,385": 1799, "1597,1565": 1800, "1800,339": 1801, "315,112": 1802, "105,280": 1803, "102,769": 1804, "562,304": 1805, "391,414": 1806, "335,802": 1807, "1732,304": 1808, "116,785": 1809, "797,263": 1810, "394,418": 1811, "764,568": 1812, "105,531": 1813, "449,116": 1814, "1594,408": 1815, "446,1745": 1816, "1816,593": 1817, "840,308": 1818, "686,304": 1819, "753,32": 1820, "671,1367": 1821, "39,715": 1822, "397,300": 1823, "116,495": 1824, "115,264": 1825, "110,492": 1826, "104,626": 1827, "487,304": 1828, "273,696": 1829, "108,280": 1830, "103,1336": 1831, "107,320": 1832, "355,275": 1833, "444,267": 1834, "585,1096": 1835, "430,663": 1836, "316,259": 1837, "100,492": 1838, "99,330": 1839, "356,293": 1840, "102,770": 1841, "84,509": 1842, "317,108": 1843, "892,564": 1844, "274,438": 1845, "473,299": 1846, "100,1319": 1847, "10,628": 1848, "74,117": 1849, "119,401": 1850, "309,108": 1851, "278,1086": 1852, "913,80": 1853, "293,98": 1854, "367,343": 1855, "845,116": 1856, "99,340": 1857, "493,304": 1858, "870,99": 1859, "270,1414": 1860, "270,263": 1861, "259,356": 1862, "285,322": 1863, "414,109": 1864, "263,1059": 1865, "297,453": 1866, "305,101": 1867, "865,107": 1868, "71,561": 1869, "115,457": 1870, "613,267": 1871, "400,546": 1872, "286,115": 1873, "110,592": 1874, "111,1103": 1875, "983,599": 1876, "605,76": 1877, "1877,1005": 1878, "118,340": 1879, "89,617": 1880, "115,421": 1881, "1413,263": 1882, "878,271": 1883, "101,302": 1884, "872,279": 1885, "98,867": 1886, "632,263": 1887, "313,658": 1888, "694,260": 1889, "297,286": 1890, "119,768": 1891, "355,303": 1892, "115,485": 1893, "76,884": 1894, "692,429": 1895, "463,67": 1896, "454,112": 1897, "309,461": 1898, "97,294": 1899, "116,374": 1900, "104,515": 1901, "1003,310": 1902, "491,265": 1903, "814,335": 1904, "278,1278": 1905, "1853,1158": 1906, "1798,385": 1907, "65,275": 1908, "721,437": 1909, "1018,301": 1910, "885,310": 1911, "570,32": 1912, "104,274": 1913, "109,1140": 1914, "1464,265": 1915, "99,268": 1916, "115,347": 1917, "71,485": 1918, "110,788": 1919, "114,373": 1920, "1110,887": 1921, "1921,78": 1922, "1922,1621": 1923, "104,284": 1924, "1195,305": 1925, "273,394": 1926, "313,974": 1927, "467,261": 1928, "331,83": 1929, "290,419": 1930, "460,305": 1931, "297,111": 1932, "367,111": 1933, "117,404": 1934, "65,32": 1935, "651,396": 1936, "1936,1416": 1937, "257,320": 1938, "1696,100": 1939, "278,650": 1940, "496,73": 1941, "1941,88": 1942, "1942,1763": 1943, "112,574": 1944, "541,415": 1945, "121,325": 1946, "274,428": 1947, "118,320": 1948, "110,280": 1949, "730,32": 1950, "478,101": 1951, "287,272": 1952, "281,399": 1953, "369,116": 1954, "119,645": 1955, "72,344": 1956, "376,288": 1957, "1254,291": 1958, "1286,433": 1959, "1959,358": 1960, "65,84": 1961, "961,111": 1962, "103,1180": 1963, "327,388": 1964, "259,300": 1965, "287,879": 1966, "274,372": 1967, "329,410": 1968, "592,1468": 1969, "516,337": 1970, "513,270": 1971, "104,1237": 1972, "326,107": 1973, "307,270": 1974, "32,316": 1975, "103,105": 1976, "257,32": 1977, "115,39": 1978, "606,301": 1979, "352,280": 1980, "335,100": 1981, "114,262": 1982, "256,284": 1983, "1421,345": 1984, "261,300": 1985, "121,267": 1986, "1383,265": 1987, "115,1231": 1988, "76,117": 1989, "278,1390": 1990, "443,1274": 1991, "1700,1625": 1992, "1682,1391": 1993, "1993,82": 1994, "1994,1115": 1995, "312,738": 1996, "585,262": 1997, "97,10": 1998, "297,314": 1999, "454,378": 2000, "659,32": 2001, "289,477": 2002, "319,280": 2003, "258,283": 2004, "289,293": 2005, "116,387": 2006, "293,102": 2007, "282,578": 2008, "109,112": 2009, "1303,257": 2010, "276,109": 2011, "1366,368": 2012, "392,284": 2013, "558,1556": 2014, "76,426": 2015, "66,682": 2016, "1996,380": 2017, "276,259": 2018, "449,258": 2019, "110,717": 2020, "32,386": 2021, "382,696": 2022, "436,39": 2023, "104,419": 2024, "77,821": 2025, "390,260": 2026, "718,258": 2027, "98,484": 2028, "265,284": 2029, "1118,325": 2030, "460,989": 2031, "359,97": 2032, "296,330": 2033, "698,107": 2034, "754,70": 2035, "2035,70": 2036, "1779,883": 2037, "2037,887": 2038, "2038,66": 2039, "2039,1371": 2040, "293,108": 2041, "500,110": 2042, "76,105": 2043, "1090,261": 2044, "99,345": 2045, "115,59": 2046, "104,632": 2047, "108,102": 2048, "489,309": 2049, "73,68": 2050, "487,395": 2051, "103,340": 2052, "294,263": 2053, "534,420": 2054, "363,10": 2055, "956,294": 2056, "112,839": 2057, "488,32": 2058, "352,101": 2059, "288,426": 2060, "1441,100": 2061, "287,758": 2062, "110,314": 2063, "294,101": 2064, "836,121": 2065, "103,1155": 2066, "332,1024": 2067, "438,80": 2068, "510,267": 2069, "278,1393": 2070, "101,59": 2071, "291,304": 2072, "635,263": 2073, "415,409": 2074, "749,32": 2075, "112,1154": 2076, "309,119": 2077, "738,368": 2078, "67,268": 2079, "326,346": 2080, "956,785": 2081, "341,296": 2082, "1415,364": 2083, "66,403": 2084, "287,270": 2085, "72,263": 2086, "373,283": 2087, "267,483": 2088, "119,979": 2089, "443,78": 2090, "2090,542": 2091, "992,949": 2092, "105,485": 2093, "404,256": 2094, "1037,379": 2095, "279,327": 2096, "115,959": 2097, "105,601": 2098, "108,285": 2099, "1527,274": 2100, "266,829": 2101, "115,412": 2102, "73,10": 2103, "98,491": 2104, "468,302": 2105, "553,301": 2106, "101,392": 2107, "347,99": 2108, "103,1095": 2109, "257,535": 2110, "773,107": 2111, "330,265": 2112, "110,601": 2113, "259,264": 2114, "293,100": 2115, "108,1734": 2116, "73,1081": 2117, "1199,308": 2118, "407,261": 2119, "108,284": 2120, "295,511": 2121, "1209,700": 2122, "67,622": 2123, "2123,300": 2124, "119,111": 2125, "82,688": 2126, "70,551": 2127, "1402,1017": 2128, "67,1322": 2129, "674,1648": 2130, "278,1507": 2131, "116,1179": 2132, "109,717": 2133, "118,362": 2134, "103,652": 2135, "67,274": 2136, "296,406": 2137, "116,766": 2138, "335,294": 2139, "107,770": 2140, "1195,379": 2141, "367,341": 2142, "114,317": 2143, "98,1686": 2144, "111,369": 2145, "445,117": 2146, "264,407": 2147, "99,258": 2148, "316,10": 2149, "116,412": 2150, "321,1718": 2151, "115,1360": 2152, "257,696": 2153, "376,818": 2154, "276,310": 2155, "471,328": 2156, "1743,1101": 2157, "447,68": 2158, "2084,291": 2159, "67,467": 2160, "77,1576": 2161, "446,68": 2162, "1349,321": 2163, "513,344": 2164, "98,323": 2165, "281,282": 2166, "814,107": 2167, "820,350": 2168, "102,629": 2169, "115,353": 2170, "118,323": 2171, "119,274": 2172, "58,434": 2173, "104,689": 2174, "313,100": 2175, "460,115": 2176, "824,842": 2177, "640,32": 2178, "115,107": 2179, "98,316": 2180, "270,294": 2181, "101,457": 2182, "99,1615": 2183, "697,2098": 2184, "566,1631": 2185, "102,333": 2186, "311,295": 2187, "525,260": 2188, "289,282": 2189, "115,109": 2190, "313,607": 2191, "461,272": 2192, "285,514": 2193, "46,39": 2194, "70,1353": 2195, "290,1237": 2196, "110,291": 2197, "620,270": 2198, "413,335": 2199, "498,354": 2200, "281,405": 2201, "103,733": 2202, "440,285": 2203, "283,423": 2204, "321,100": 2205, "263,384": 2206, "1644,315": 2207, "646,847": 2208, "744,32": 2209, "567,321": 2210, "403,107": 2211, "438,76": 2212, "111,104": 2213, "1034,420": 2214, "100,841": 2215, "1288,337": 2216, "116,798": 2217, "340,356": 2218, "306,396": 2219, "68,614": 2220, "359,442": 2221, "112,439": 2222, "84,111": 2223, "101,535": 2224, "103,317": 2225, "119,1056": 2226, "627,270": 2227, "115,460": 2228, "461,657": 2229, "306,818": 2230, "67,341": 2231, "986,325": 2232, "516,260": 2233, "460,379": 2234, "114,316": 2235, "112,1484": 2236, "98,117": 2237, "296,387": 2238, "112,316": 2239, "10,838": 2240, "698,728": 2241, "296,291": 2242, "677,261": 2243, "278,1428": 2244, "2161,2146": 2245, "278,1475": 2246, "1045,256": 2247, "115,333": 2248, "263,265": 2249, "110,1027": 2250, "112,105": 2251, "264,10": 2252, "2043,349": 2253, "1861,374": 2254, "83,1860": 2255, "1034,357": 2256, "276,2048": 2257, "331,307": 2258, "605,70": 2259, "2259,2050": 2260, "2260,519": 2261, "466,464": 2262, "115,33": 2263, "306,345": 2264, "382,292": 2265, "297,911": 2266, "263,301": 2267, "813,491": 2268, "364,112": 2269, "109,768": 2270, "116,373": 2271, "103,302": 2272, "332,282": 2273, "264,547": 2274, "331,483": 2275, "1703,325": 2276, "328,955": 2277, "832,349": 2278, "110,419": 2279, "76,826": 2280, "2280,90": 2281, "278,1539": 2282, "1705,267": 2283, "671,1708": 2284, "67,97": 2285, "87,425": 2286, "530,271": 2287, "287,1409": 2288, "892,406": 2289, "280,392": 2290, "111,296": 2291, "262,257": 2292, "750,279": 2293, "438,67": 2294, "77,518": 2295, "261,563": 2296, "512,118": 2297, "359,499": 2298, "80,343": 2299, "796,364": 2300, "711,517": 2301, "300,395": 2302, "58,273": 2303, "261,313": 2304, "352,480": 2305, "678,2268": 2306, "119,316": 2307, "84,389": 2308, "67,266": 2309, "380,115": 2310, "331,410": 2311, "408,258": 2312, "102,2211": 2313, "583,302": 2314, "463,80": 2315, "1849,306": 2316, "84,548": 2317, "371,73": 2318, "1762,267": 2319, "2231,1934": 2320, "87,393": 2321, "300,451": 2322, "281,10": 2323, "490,304": 2324, "39,275": 2325, "1785,830": 2326, "345,284": 2327, "44,39": 2328, "751,32": 2329, "296,551": 2330, "117,275": 2331, "625,280": 2332, "588,260": 2333, "620,655": 2334, "1639,110": 2335, "1954,407": 2336, "320,489": 2337, "83,398": 2338, "332,367": 2339, "59,273": 2340, "341,310": 2341, "630,830": 2342, "1007,258": 2343, "109,394": 2344, "745,595": 2345, "291,282": 2346, "106,1127": 2347, "466,667": 2348, "356,475": 2349, "289,547": 2350, "386,32": 2351, "1958,1834": 2352, "32,782": 2353, "449,403": 2354, "58,304": 2355, "397,1020": 2356, "529,10": 2357, "67,846": 2358, "522,1617": 2359, "1028,362": 2360, "101,33": 2361, "330,103": 2362, "119,559": 2363, "58,549": 2364, "296,335": 2365, "100,416": 2366, "453,325": 2367, "82,292": 2368, "119,292": 2369, "623,107": 2370, "380,379": 2371, "934,407": 2372, "996,103": 2373, "306,256": 2374, "274,260": 2375, "274,452": 2376, "100,645": 2377, "305,259": 2378, "656,257": 2379, "118,383": 2380, "1299,308": 2381, "114,552": 2382, "100,259": 2383, "283,432": 2384, "277,628": 2385, "366,264": 2386, "1444,364": 2387, "256,338": 2388, "1424,379": 2389, "331,65": 2390, "85,82": 2391, "1592,325": 2392, "102,578": 2393, "71,1629": 2394, "695,1817": 2395, "961,269": 2396, "644,521": 2397, "278,1725": 2398, "69,66": 2399, "2399,1286": 2400, "2400,1323": 2401, "572,1801": 2402, "102,101": 2403, "338,323": 2404, "116,316": 2405, "77,926": 2406, "111,98": 2407, "1688,263": 2408, "306,99": 2409, "67,519": 2410, "1058,107": 2411, "384,356": 2412, "288,97": 2413, "332,507": 2414, "102,309": 2415, "1259,996": 2416, "73,1868": 2417, "1050,269": 2418, "305,270": 2419, "105,340": 2420, "360,981": 2421, "1199,275": 2422, "107,270": 2423, "438,66": 2424, "463,66": 2425, "654,322": 2426, "504,268": 2427, "101,537": 2428, "1076,378": 2429, "118,401": 2430, "1132,1289": 2431, "97,260": 2432, "109,1553": 2433, "1398,299": 2434, "1061,291": 2435, "565,314": 2436, "1720,267": 2437, "79,87": 2438, "83,2184": 2439, "80,453": 2440, "2160,387": 2441, "1490,441": 2442, "840,275": 2443, "296,979": 2444, "277,77": 2445, "431,32": 2446, "553,614": 2447, "309,100": 2448, "98,347": 2449, "86,403": 2450, "529,337": 2451, "1299,275": 2452, "472,418": 2453, "115,291": 2454, "115,481": 2455, "300,293": 2456, "621,260": 2457, "859,121": 2458, "1869,378": 2459, "80,114": 2460, "258,284": 2461, "100,788": 2462, "99,335": 2463, "109,98": 2464, "272,346": 2465, "103,343": 2466, "116,1466": 2467, "375,965": 2468, "1667,769": 2469, "296,437": 2470, "985,325": 2471, "1093,655": 2472, "10,83": 2473, "296,322": 2474, "63,400": 2475, "67,104": 2476, "376,802": 2477, "369,108": 2478, "101,257": 2479, "66,2435": 2480, "2480,2011": 2481, "84,267": 2482, "117,97": 2483, "1572,1014": 2484, "264,97": 2485, "572,1943": 2486, "71,1095": 2487, "1524,68": 2488, "2488,902": 2489, "2489,339": 2490, "117,98": 2491, "327,295": 2492, "369,373": 2493, "695,371": 2494, "102,111": 2495, "105,306": 2496, "286,116": 2497, "543,102": 2498, "566,1714": 2499, "399,388": 2500, "338,281": 2501, "290,323": 2502, "73,261": 2503, "10,1100": 2504, "65,258": 2505, "567,600": 2506, "933,362": 2507, "112,408": 2508, "1141,116": 2509, "355,372": 2510, "263,302": 2511, "103,575": 2512, "310,646": 2513, "597,285": 2514, "335,118": 2515, "104,630": 2516, "111,381": 2517, "449,112": 2518, "98,440": 2519, "391,314": 2520, "116,1163": 2521, "362,265": 2522, "862,285": 2523, "2394,1613": 2524, "1146,2313": 2525, "278,1647": 2526, "288,111": 2527, "1402,599": 2528, "105,269": 2529, "712,272": 2530, "1181,263": 2531, "1228,256": 2532, "277,984": 2533, "284,295": 2534, "87,1143": 2535, "108,319": 2536, "529,2078": 2537, "73,822": 2538, "287,719": 2539, "1510,393": 2540, "610,423": 2541, "100,1887": 2542, "282,1234": 2543, "889,121": 2544, "355,308": 2545, "423,261": 2546, "98,1144": 2547, "257,577": 2548, "278,1755": 2549, "282,609": 2550, "119,897": 2551, "553,378": 2552, "277,659": 2553, "394,410": 2554, "620,103": 2555, "10,533": 2556, "633,32": 2557, "87,401": 2558, "277,640": 2559, "32,619": 2560, "1610,258": 2561, "298,1443": 2562, "111,301": 2563, "522,352": 2564, "107,729": 2565, "1488,876": 2566, "79,80": 2567, "782,605": 2568, "2568,77": 2569, "2569,1371": 2570, "2570,542": 2571, "2040,1991": 2572, "443,2317": 2573, "2573,385": 2574, "287,320": 2575, "265,283": 2576, "495,259": 2577, "121,453": 2578, "329,1078": 2579, "613,445": 2580, "114,319": 2581, "101,481": 2582, "115,526": 2583, "856,404": 2584, "472,324": 2585, "452,459": 2586, "1405,1061": 2587, "10,659": 2588, "628,32": 2589, "420,281": 2590, "102,1353": 2591, "394,324": 2592, "287,518": 2593, "352,431": 2594, "101,463": 2595, "1976,470": 2596, "279,342": 2597, "475,261": 2598, "2023,263": 2599, "118,285": 2600, "1151,99": 2601, "765,345": 2602, "1261,108": 2603, "369,861": 2604, "516,257": 2605, "100,467": 2606, "84,551": 2607, "119,319": 2608, "610,505": 2609, "277,68": 2610, "836,264": 2611, "287,264": 2612, "1032,293": 2613, "97,465": 2614, "76,266": 2615, "2615,454": 2616, "80,111": 2617, "112,270": 2618, "807,346": 2619, "671,1760": 2620, "359,323": 2621, "278,844": 2622, "65,71": 2623, "584,1836": 2624, "66,1520": 2625, "1361,1683": 2626, "548,90": 2627, "2627,890": 2628, "2628,339": 2629, "1566,257": 2630, "82,1056": 2631, "369,275": 2632, "115,544": 2633, "390,954": 2634, "115,362": 2635, "850,609": 2636, "763,383": 2637, "104,691": 2638, "256,295": 2639, "1118,407": 2640, "257,1236": 2641, "352,614": 2642, "384,283": 2643, "104,976": 2644, "757,467": 2645, "10,307": 2646, "2373,257": 2647, "515,270": 2648, "98,285": 2649, "680,345": 2650, "391,509": 2651, "415,32": 2652, "475,507": 2653, "316,507": 2654, "302,361": 2655, "452,418": 2656, "309,103": 2657, "1523,265": 2658, "436,120": 2659, "376,261": 2660, "287,591": 2661, "109,1105": 2662, "1595,2091": 2663, "533,955": 2664, "80,292": 2665, "572,1878": 2666, "695,73": 2667, "1347,1907": 2668, "2625,454": 2669, "119,611": 2670, "985,10": 2671, "522,318": 2672, "516,107": 2673, "450,1765": 2674, "441,333": 2675, "264,1671": 2676, "102,1161": 2677, "627,269": 2678, "306,830": 2679, "256,279": 2680, "863,112": 2681, "798,345": 2682, "277,84": 2683, "87,344": 2684, "87,354": 2685, "296,319": 2686, "99,1047": 2687, "413,314": 2688, "1270,121": 2689, "330,368": 2690, "1057,327": 2691, "283,722": 2692, "10,488": 2693, "65,1052": 2694, "264,261": 2695, "453,294": 2696, "343,112": 2697, "321,259": 2698, "582,560": 2699, "115,755": 2700, "10,84": 2701, "367,449": 2702, "380,381": 2703, "294,1973": 2704, "366,440": 2705, "10,483": 2706, "382,1205": 2707, "454,1380": 2708, "103,841": 2709, "376,352": 2710, "116,425": 2711, "522,1902": 2712, "846,116": 2713, "622,302": 2714, "298,381": 2715, "553,102": 2716, "105,817": 2717, "903,32": 2718, "566,1744": 2719, "786,1200": 2720, "2159,2034": 2721, "2440,414": 2722, "458,665": 2723, "446,77": 2724, "2724,1524": 2725, "2725,542": 2726, "1391,68": 2727, "2727,385": 2728, "83,951": 2729, "398,570": 2730, "109,316": 2731, "115,375": 2732, "737,372": 2733, "115,270": 2734, "116,291": 2735, "384,295": 2736, "729,259": 2737, "65,117": 2738, "99,555": 2739, "352,437": 2740, "97,928": 2741, "585,289": 2742, "1334,954": 2743, "553,350": 2744, "683,261": 2745, "413,272": 2746, "104,292": 2747, "116,935": 2748, "845,407": 2749, "80,2112": 2750, "354,295": 2751, "881,388": 2752, "259,378": 2753, "454,308": 2754, "1813,266": 2755, "115,541": 2756, "367,512": 2757, "70,97": 2758, "646,2155": 2759, "276,112": 2760, "267,66": 2761, "370,483": 2762, "651,274": 2763, "100,1562": 2764, "82,65": 2765, "103,2177": 2766, "992,514": 2767, "274,395": 2768, "1521,1417": 2769, "319,320": 2770, "447,1274": 2771, "74,79": 2772, "566,1322": 2773, "1347,1799": 2774, "1070,68": 2775, "2775,469": 2776, "330,728": 2777, "121,2216": 2778, "115,440": 2779, "353,726": 2780, "513,269": 2781, "73,975": 2782, "543,2219": 2783, "293,662": 2784, "102,264": 2785, "355,2171": 2786, "2738,2584": 2787, "596,258": 2788, "933,526": 2789, "2194,271": 2790, "806,258": 2791, "326,582": 2792, "289,10": 2793, "105,1676": 2794, "1820,847": 2795, "261,268": 2796, "290,927": 2797, "10,68": 2798, "109,666": 2799, "643,346": 2800, "1573,302": 2801, "384,328": 2802, "536,604": 2803, "296,425": 2804, "115,342": 2805, "595,302": 2806, "853,32": 2807, "290,262": 2808, "105,346": 2809, "102,330": 2810, "288,979": 2811, "331,324": 2812, "592,412": 2813, "1462,714": 2814, "278,1662": 2815, "2126,616": 2816, "72,1573": 2817, "2772,72": 2818, "2818,78": 2819, "1940,1055": 2820, "83,548": 2821, "1042,261": 2822, "331,571": 2823, "347,103": 2824, "606,118": 2825, "315,256": 2826, "440,310": 2827, "342,320": 2828, "257,1007": 2829, "265,295": 2830, "460,264": 2831, "367,286": 2832, "475,32": 2833, "115,403": 2834, "294,111": 2835, "110,263": 2836, "257,555": 2837, "508,335": 2838, "836,265": 2839, "273,577": 2840, "803,378": 2841, "293,405": 2842, "327,283": 2843, "373,284": 2844, "327,523": 2845, "288,766": 2846, "1368,310": 2847, "263,258": 2848, "536,685": 2849, "583,340": 2850, "2079,105": 2851, "2851,403": 2852, "2852,266": 2853, "1262,264": 2854, "287,557": 2855, "115,706": 2856, "369,2426": 2857, "264,282": 2858, "341,701": 2859, "266,531": 2860, "1867,107": 2861, "77,879": 2862, "335,296": 2863, "321,119": 2864, "259,398": 2865, "384,284": 2866, "414,112": 2867, "104,739": 2868, "32,268": 2869, "277,810": 2870, "2192,1851": 2871, "45,1417": 2872, "313,774": 2873, "110,333": 2874, "403,265": 2875, "992,1020": 2876, "109,438": 2877, "674,1778": 2878, "520,1778": 2879, "1090,32": 2880, "1254,1871": 2881, "72,1683": 2882, "2401,267": 2883, "1599,116": 2884, "1098,394": 2885, "640,409": 2886, "281,975": 2887, "1456,429": 2888, "598,304": 2889, "516,462": 2890, "1997,260": 2891, "391,335": 2892, "280,440": 2893, "76,2367": 2894, "357,1197": 2895, "1349,411": 2896, "527,118": 2897, "73,82": 2898, "76,518": 2899, "668,1234": 2900, "720,384": 2901, "105,97": 2902, "341,954": 2903, "296,10": 2904, "263,865": 2905, "822,116": 2906, "508,284": 2907, "116,884": 2908, "32,421": 2909, "369,100": 2910, "375,619": 2911, "1693,310": 2912, "335,763": 2913, "112,374": 2914, "266,293": 2915, "290,268": 2916, "59,304": 2917, "121,45": 2918, "287,829": 2919, "1715,951": 2920, "73,1643": 2921, "98,528": 2922, "553,107": 2923, "112,491": 2924, "845,450": 2925, "932,388": 2926, "99,336": 2927, "99,343": 2928, "361,295": 2929, "109,452": 2930, "441,595": 2931, "562,395": 2932, "114,272": 2933, "568,377": 2934, "449,104": 2935, "1330,107": 2936, "259,328": 2937, "101,268": 2938, "588,2242": 2939, "2524,407": 2940, "380,310": 2941, "1961,816": 2942, "2942,2016": 2943, "80,272": 2944, "2158,32": 2945, "73,84": 2946, "278,1761": 2947, "70,1995": 2948, "2281,2069": 2949, "67,469": 2950, "75,319": 2951, "606,99": 2952, "534,500": 2953, "342,283": 2954, "108,291": 2955, "450,1374": 2956, "472,459": 2957, "460,601": 2958, "1457,256": 2959, "59,282": 2960, "1712,1620": 2961, "964,285": 2962, "1640,417": 2963, "513,292": 2964, "383,265": 2965, "105,256": 2966, "281,257": 2967, "73,754": 2968, "98,428": 2969, "77,101": 2970, "280,503": 2971, "356,409": 2972, "299,257": 2973, "264,524": 2974, "1559,256": 2975, "538,357": 2976, "103,394": 2977, "273,555": 2978, "302,502": 2979, "309,396": 2980, "347,699": 2981, "793,2427": 2982, "266,99": 2983, "98,274": 2984, "364,10": 2985, "99,403": 2986, "1516,265": 2987, "667,773": 2988, "356,395": 2989, "257,758": 2990, "374,32": 2991, "698,349": 2992, "80,263": 2993, "107,2715": 2994, "352,877": 2995, "497,327": 2996, "288,1056": 2997, "32,570": 2998, "84,839": 2999, "1361,1960": 3000, "347,258": 3001, "76,1434": 3002, "671,1781": 3003, "572,1906": 3004, "66,2713": 3005, "3005,635": 3006, "98,272": 3007, "370,65": 3008, "108,602": 3009, "1204,299": 3010, "1066,1140": 3011, "501,459": 3012, "101,544": 3013, "401,305": 3014, "111,325": 3015, "112,1863": 3016, "571,279": 3017, "527,381": 3018, "118,1582": 3019, "489,1494": 3020, "2968,469": 3021, "282,274": 3022, "1334,100": 3023, "382,535": 3024, "71,309": 3025, "290,689": 3026, "303,1884": 3027, "1148,259": 3028, "290,708": 3029, "692,285": 3030, "293,928": 3031, "102,1324": 3032, "80,108": 3033, "283,323": 3034, "261,608": 3035, "793,403": 3036, "102,661": 3037, "500,259": 3038, "101,419": 3039, "369,300": 3040, "576,418": 3041, "101,649": 3042, "370,307": 3043, "391,389": 3044, "261,800": 3045, "1058,257": 3046, "107,990": 3047, "117,1181": 3048, "289,475": 3049, "273,344": 3050, "630,1439": 3051, "376,1617": 3052, "115,637": 3053, "333,294": 3054, "98,1920": 3055, "721,406": 3056, "1111,517": 3057, "101,927": 3058, "100,559": 3059, "473,1208": 3060, "330,1289": 3061, "423,399": 3062, "116,362": 3063, "277,66": 3064, "376,2014": 3065, "522,288": 3066, "461,105": 3067, "103,492": 3068, "1043,914": 3069, "341,377": 3070, "110,32": 3071, "366,1645": 3072, "71,2938": 3073, "109,661": 3074, "83,2312": 3075, "1188,86": 3076, "3076,446": 3077, "3077,358": 3078, "2295,1928": 3079, "1186,891": 3080, "961,485": 3081, "76,69": 3082, "675,104": 3083, "1939,267": 3084, "1323,2950": 3085, "1472,1799": 3086, "121,329": 3087, "939,1581": 3088, "1804,412": 3089, "295,109": 3090, "420,327": 3091, "112,453": 3092, "796,264": 3093, "32,586": 3094, "364,561": 3095, "117,330": 3096, "82,499": 3097, "359,272": 3098, "404,103": 3099, "627,344": 3100, "1030,420": 3101, "367,272": 3102, "69,1052": 3103, "280,377": 3104, "83,1134": 3105, "274,394": 3106, "317,116": 3107, "332,297": 3108, "104,927": 3109, "332,1284": 3110, "278,1923": 3111, "908,259": 3112, "1044,654": 3113, "862,485": 3114, "84,1143": 3115, "103,345": 3116, "2199,495": 3117, "729,115": 3118, "274,580": 3119, "98,785": 3120, "87,387": 3121, "518,118": 3122, "639,256": 3123, "289,686": 3124, "277,533": 3125, "543,2380": 3126, "97,365": 3127, "293,297": 3128, "391,317": 3129, "1444,372": 3130, "296,849": 3131, "89,670": 3132, "340,471": 3133, "737,118": 3134, "119,2561": 3135, "112,623": 3136, "312,32": 3137, "115,589": 3138, "508,387": 3139, "296,272": 3140, "405,111": 3141, "489,109": 3142, "290,714": 3143, "863,109": 3144, "1227,755": 3145, "513,696": 3146, "398,361": 3147, "1048,32": 3148, "551,116": 3149, "282,97": 3150, "889,1659": 3151, "424,100": 3152, "404,100": 3153, "313,895": 3154, "2616,761": 3155, "277,838": 3156, "69,120": 3157, "674,1177": 3158, "359,746": 3159, "463,76": 3160, "2819,2353": 3161, "3161,71": 3162, "3162,605": 3163, "3163,78": 3164, "566,2319": 3165, "510,66": 3166, "3166,2438": 3167, "1490,505": 3168, "862,611": 3169, "293,99": 3170, "1407,121": 3171, "117,817": 3172, "866,388": 3173, "307,344": 3174, "291,10": 3175, "309,1690": 3176, "118,374": 3177, "676,327": 3178, "112,997": 3179, "342,327": 3180, "522,818": 3181, "102,323": 3182, "338,316": 3183, "267,640": 3184, "382,556": 3185, "98,340": 3186, "296,299": 3187, "101,321": 3188, "404,345": 3189, "668,721": 3190, "498,272": 3191, "968,304": 3192, "332,413": 3193, "370,957": 3194, "578,539": 3195, "383,310": 3196, "382,265": 3197, "98,1620": 3198, "287,268": 3199, "286,296": 3200, "77,406": 3201, "115,289": 3202, "668,437": 3203, "114,315": 3204, "58,282": 3205, "285,949": 3206, "103,341": 3207, "72,322": 3208, "314,32": 3209, "103,103": 3210, "291,297": 3211, "779,327": 3212, "985,261": 3213, "362,880": 3214, "288,316": 3215, "697,268": 3216, "1245,310": 3217, "33,731": 3218, "76,484": 3219, "493,285": 3220, "882,32": 3221, "554,260": 3222, "302,328": 3223, "365,691": 3224, "100,611": 3225, "356,684": 3226, "444,261": 3227, "257,264": 3228, "119,798": 3229, "511,261": 3230, "460,1232": 3231, "1972,417": 3232, "264,364": 3233, "101,407": 3234, "1823,258": 3235, "1528,264": 3236, "441,112": 3237, "2675,112": 3238, "103,452": 3239, "79,120": 3240, "3240,300": 3241, "291,45": 3242, "584,2945": 3243, "71,97": 3244, "1016,322": 3245, "84,89": 3246, "963,2623": 3247, "3247,85": 3248, "3248,542": 3249, "51,32": 3250, "3250,520": 3251, "3251,1287": 3252, "3252,73": 3253, "3253,271": 3254, "72,962": 3255, "3255,1791": 3256, "2186,368": 3257, "99,867": 3258, "531,